Configuration/Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<BasedOn>
				<xr:Item>Document.ПредварительнаяЗапись</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчётЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительнаяЗапись</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccumulationRegisters/УчётЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УчётЗатрат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительнаяЗапись</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Configuration/Documents/Реализация/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.УчётЗатрат.Записывать      = Истина;
	Движения.ЗаказыКлиентов.Записывать  = Истина;
	Движения.Продажи.Записывать         = Истина;
	Движения.Хозрасчетный.Записывать    = Истина;

	Движения.ТоварыНаСкладах.Записать();
	Движения.ТоварыНаСкладах.Записывать = Истина;

	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.ИсточникДанных = Товары;
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Элемент.УстановитьЗначение("Организация", Организация);
	Элемент.УстановитьЗначение("Склад", Склад);
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",        Ссылка);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Склад",         Склад);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК ЭтоТовар,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма,
	|	МАКСИМУМ(РеализацияТовары.Номенклатура.СчетБухгалтерскогоУчета) КАК СчетБухгалтерскогоУчета
	|ПОМЕСТИТЬ ВТ_Строки
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	ЛОЖЬ,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Строки.Номенклатура КАК Номенклатура,
	|	ВТ_Строки.ЭтоТовар КАК ЭтоТовар,
	|	ВТ_Строки.Количество КАК Количество,
	|	ВТ_Строки.Сумма КАК Сумма,
	|	ВТ_Строки.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Строки.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ВТ_Строки КАК ВТ_Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ ВТ_Строки.Номенклатура КАК Номенклатура ИЗ ВТ_Строки КАК ВТ_Строки)) КАК Остатки
	|		ПО ВТ_Строки.Номенклатура = Остатки.Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(ЭтоТовар) КАК ЭтоТовар,
	|	МАКСИМУМ(Количество) КАК Количество,
	|	МАКСИМУМ(Сумма) КАК Сумма,
	|	МАКСИМУМ(СчетБухгалтерскогоУчета) КАК СчетБухгалтерскогоУчета,
	|	МАКСИМУМ(КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(СуммаОстаток) КАК СуммаОстаток
	|ПО
	|	СтатьяЗатрат,
	|	Номенклатура";

	ВыборкаЗатрат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаЗатрат.Следующий() Цикл

		СуммаСебестоимости = 0;

		ВыборкаНоменклатуры = ВыборкаЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатуры.Следующий() Цикл

			ДвижениеПродажа              = Движения.Продажи.Добавить();
			ДвижениеПродажа.Период       = Дата;
			ДвижениеПродажа.Организация   = Организация;
			ДвижениеПродажа.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
			ДвижениеПродажа.Контрагент   = Контрагент;
			ДвижениеПродажа.Сотрудник    = Сотрудник;
			ДвижениеПродажа.Количество   = ВыборкаНоменклатуры.Количество;
			ДвижениеПродажа.Сумма        = ВыборкаНоменклатуры.Сумма;

			Если НЕ ВыборкаНоменклатуры.ЭтоТовар Тогда
				Продолжить;
			КонецЕсли;

			Если ВыборкаНоменклатуры.Количество > ВыборкаНоменклатуры.КоличествоОстаток Тогда
				Отказ = Истина;
				ТекстНехватки = СтрШаблон("Не хватает ""%1"" в количестве %2",
					ВыборкаНоменклатуры.Номенклатура,
					ВыборкаНоменклатуры.Количество - ВыборкаНоменклатуры.КоличествоОстаток);
				ОбщегоНазначения.СообщитьПользователю(ТекстНехватки);
				Продолжить;
			КонецЕсли;

			Если ВыборкаНоменклатуры.КоличествоОстаток = 0 Тогда
				СредняяЦена = 0;
			Иначе
				СредняяЦена = ВыборкаНоменклатуры.СуммаОстаток / ВыборкаНоменклатуры.КоличествоОстаток;
			КонецЕсли;
			Себестоимость      = Окр(СредняяЦена * ВыборкаНоменклатуры.Количество, 2);
			СуммаСебестоимости = СуммаСебестоимости + Себестоимость;

			ДвижениеТовар              = Движения.ТоварыНаСкладах.Добавить();
			ДвижениеТовар.ВидДвижения  = ВидДвиженияНакопления.Расход;
			ДвижениеТовар.Период       = Дата;
			ДвижениеТовар.Организация   = Организация;
			ДвижениеТовар.Склад        = Склад;
			ДвижениеТовар.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
			ДвижениеТовар.Количество   = ВыборкаНоменклатуры.Количество;
			ДвижениеТовар.Сумма        = Себестоимость;

			ДвижениеПроводка            = Движения.Хозрасчетный.Добавить();
			ДвижениеПроводка.Период     = Дата;
			ДвижениеПроводка.СчетДт     = ПланыСчетов.Хозрасчетный.Продажи;
			ДвижениеПроводка.СчетКт     = ВыборкаНоменклатуры.СчетБухгалтерскогоУчета;
			ДвижениеПроводка.Сумма      = Себестоимость;
			ДвижениеПроводка.Содержание = "Списана себестоимость товарно-материальных ценностей";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеПроводка.СчетКт, ДвижениеПроводка.СубконтоКт, ВыборкаНоменклатуры.Номенклатура);

		КонецЦикла;

		Если СуммаСебестоимости <> 0 И ЗначениеЗаполнено(ВыборкаЗатрат.СтатьяЗатрат) Тогда
			ДвижениеЗатраты              = Движения.УчётЗатрат.Добавить();
			ДвижениеЗатраты.Период       = Дата;
			ДвижениеЗатраты.Организация   = Организация;
			ДвижениеЗатраты.СтатьяЗатрат = ВыборкаЗатрат.СтатьяЗатрат;
			ДвижениеЗатраты.Сумма        = СуммаСебестоимости;
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДвижениеЗаказ              = Движения.ЗаказыКлиентов.Добавить();
		ДвижениеЗаказ.ВидДвижения  = ВидДвиженияНакопления.Расход;
		ДвижениеЗаказ.Период       = Дата;
		ДвижениеЗаказ.Организация   = Организация;
		ДвижениеЗаказ.Клиент       = Контрагент;
		ДвижениеЗаказ.ЗаказКлиента = ДокументОснование;
		ДвижениеЗаказ.Сумма        = Услуги.Итог("Сумма");
	КонецЕсли;

	ДвижениеВыручка            = Движения.Хозрасчетный.Добавить();
	ДвижениеВыручка.Период     = Дата;
	ДвижениеВыручка.СчетДт     = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	ДвижениеВыручка.СчетКт     = ПланыСчетов.Хозрасчетный.Продажи;
	ДвижениеВыручка.Сумма      = СуммаДокумента;
	ДвижениеВыручка.Содержание = "Отражена выручка от реализации товаров и услуг";
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеВыручка.СчетДт, ДвижениеВыручка.СубконтоДт, Контрагент);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда

		Организация       = ДанныеЗаполнения.Организация;
		Контрагент        = ДанныеЗаполнения.Клиент;          		
		Сотрудник         = ДанныеЗаполнения.Сотрудник;
		СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
		ДокументОснование = ДанныеЗаполнения;

		Комментарий = "Введен на основании: Предварительная запись №"
			+ СокрЛП(ДанныеЗаполнения.Номер) + " от "
			+ Формат(ДанныеЗаполнения.Дата, "ДЛФ=Д");

		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);  
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
